//會員條款
import React from 'react'
class MemberShipRules extends React.Component {
    constructor(props) {
        super(props);
        // this.toggleMenuActive=this.toggleMenuActive.bind(this);
        this.state = {
            // active:false
        }
    }


    render() {
        return (
            <div className="">
                於「tixCraft拓元售票系統服務條款」之中所使用之用語、簡稱，定義如下：
「本條款」：即指「tixCraft拓元售票系統服務條款」。
「本公司」：即指拓元股份有限公司。
「本系統」：本公司所營運之tixCraft拓元售票系統網站所有頁面，及本公司所開設、營運之電子郵件帳號、公式社交網站帳號。
「使用者」：本系統之使用者。前述使用包含註冊會員帳號、透過本網站購入票券、商品、單純瀏覽、檢索資料、提出詢問等行為。
「個人資料」：依個人資料保護法第2條第1項所定義之個人資料。
第2條(認知與同意接受)

本系統係依據本條款提供服務。當您以本系統會員帳號登入並使用本系統時，即表示您已閱讀、瞭解並同意接受服務條款之所有內容。
本系統不接受未滿7歲之無行為能力人註冊會員。若您是7歲以上、未滿20歲之未成年人，應由您的法定代理人閱讀、暸解、並同意服務條款之所有內容，始得開始使用或繼續使用tixCraft拓元售票系統提供之服務。如您開始使用或繼續使用本系統，即推定您的法定代理人已閱讀、暸解、並同意服務條款之所有內容。
本系統係受主辦單位委託處理票券事務之系統平台，各別節目資訊皆由主辦單位制定提供，若您對活動演出之演出內容、品質、延遲演出、改期及相關事宜有任何疑問，請您直接洽詢活動演出主辦單位，並請配合主辦單位所發之通知與規定辦理。
第3條(本條款適用範圍)

本系統所公布之「隱私權條款」、各節目頁面之內容(包含但不限於主辦單位資訊、銷售資訊、表演內容、付款方式、票券交付、退換票機制、票券毀損、滅失及遺失之進場機制、入場規範及消費爭議處理等事項)、其他規定、未來新增或修改之規定，皆為本條款之一部。
如節目資訊之頁面內容或各演出場地，就該節目之票券交易有別於本條款之特別規定，應優先適用該特別規定。
第4條(本條款之變更)

本公司得因法令變更或未盡事宜隨時增減修改本條款之一部或全部，並得溯及適用於已成立但未終止、消滅之交易。
前項之變更經公告於本系統或以其他方式通知使用者後即生通知之效力。使用者不得主張未受通知而不受本條款之拘束。
第5條(通知)

對使用者之必要事項通知，以本系統之網站公告為原則。如有必要，本公司得另以電話、電子郵件或其他適當方法聯絡使用者。
前項通知如以網站公告方式為之，自公告日起發生通知效力；如以電子郵件方式為之，則以本公司向使用者發信之日為通知生效日，使用者應確認在本系統之電子郵件信箱為其經常使用者，並不因使用者未讀取信件、信件遭郵件網站系統商歸為垃圾郵件等事由，而生遲延之效果。
第6條(會員資料之登錄)

本系統每一使用者限制僅可申請一個會員帳號，此會員帳號需綁定『證件字號與手機號碼」，已使用之證件字號或手機號碼無法重複綁定其他帳號。每一會員帳號需完成驗證程序後方取得完整會員權利。
使用者得隨時利用第三方服務之帳號登入tixCraft拓元售票系統網站之會員帳號，接收活動及優惠訊息、購買票券或其他方式利用本系統。
如因使用者選用之第三方服務一時或永久停止服務、刪除或凍結使用者之第三方服務帳號之使用權限，將可能會連帶影響本系統之利用，所生之不便或損害使用者不得要求本公司為任何形式之補償或賠償。
使用者填寫會員資料應遵守下列事項
依本系統會員基本資料表之提示，提供會員本人正確、最新及完整的資料，且不得以他人名義註冊為會員。
定期維持並更新會員資料，確保會員資料為正確、最新及完整狀態。
冒用他人身分證字號或個人資料，恐有觸犯刑法第220條第2項、第216條、第210條之行使偽造準私文書罪及其他法令之虞，使用者於登錄會員資料時應瞭解不實登錄之法律責任，並保證提供之資料真實無虞。
如使用者未按指定方式提供資料、所提供之資料不正確或與事實不符、或未即時更新資料，本公司得不經事先通知，隨時拒絕、或暫停對該使用者提供本系統服務之全部或一部。
第7條(會員資料之變更)

使用者所登錄之會員資料主要作為領取票券之身分依據、寄送票券或商品之收件資料之用，如會員資料有變更或錯誤，使用者應即時依本系統公告之修改方式儘速修正之。
如會員資料有未即時修正之變更或錯誤，導致訂單發生錯誤、失敗或是影響後續進場及退換票等其他事宜之辦理，使用者不得要求本公司為任何形式之補償或賠償。
第8條(利用環境)

使用者使用本系統前應自行準備必要的通訊設備及網際網路連線服務，並維持管理其可利用性，一切網際網路連線所生之通訊費、連線費由使用者自行負擔。
因線路壅塞或通訊設備運算緩慢、當機等類似情事發生，致訂單重複送出、訂單成立之通知遲延到達或訂購失敗等結果，對於使用者或第三人所生之損害，本公司不負損害賠償責任。
第9條(禁止事項)

使用者承諾絕不為任何非法目的或以任何非法方式使用本系統，並承諾遵守中華民國法規及一切使用網際網路之國際規約、習慣，且不利用本系統從事侵害他人權益或違法之行為，包括但不限於：
對於本公司或第三人之商標權、專利、著作權、或其他智慧財產權之侵害行為。
對於本公司或第三人之毀謗、侮辱或類似之妨礙名譽、信用之違法行為。
利用本系統為詐欺、以不正方法由收費設備、自動付款設備取得他人之物等侵害本公司或第三人財產權之違法行為。
使用非法程式或手段侵入、攻擊本系統，或其他類似之妨礙電腦使用之違法行為。
冒用他人身分證字號或個人資料登錄，或其他類似之偽造文書之違法行為。
利用、透過本系統為性交易、宗教、政治、選舉宣傳等與本系統使用目的無關之使用。
未得本公司同意，利用本系統為營利行為或使其看似與本系統有關之營利行為。
違反法令或公序良俗之一切行為。
其他本公司判定不當之使用。
使用者違反前項禁止事項時，本公司得禁止或限制使用者使用本系統之權利。若因此致本公司受有損害，本公司得就所受損害請求賠償。
第10條(智慧財產權及肖像權)

本系統所使用之軟體或程式、網站上所有內容（包括但不限於著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計、會員內容），均由本系統或其他權利人依法擁有其智慧財產權（包括但不限於商標權、專利權、著作權、營業秘密與專有技術）。非經本公司或權利所有者之同意，使用者不得逕自使用、修改、重製、公開播送、公開傳輸、公開演出、改作、散布、發行、公開發表、進行還原工程、解編或反向組譯。
本公司對於使用者經由本系統連結至其他網站而下載的軟體或資料，不負任何擔保責任。
使用者如因智慧財產及肖像權權利問題與權利所有者間涉訟，應自行承擔法律責任，與本公司無涉。
第11條(服務之中斷、中止)

於發生下列情形之一時，本公司得停止、中斷提供服務：
本系統設置之電子通訊設備進行必要之保養及施工，致無法提供服務時。
本系統使用之電子通訊服務或設備發生突發性之故障、停止，致無法提供服務時。
由於天災等不可抗力或其他不可歸責於本公司之因素，致無法提供服務時。
其他因本公司判斷有中斷、中止服務必要之情事。
若因本系統服務中斷、中止，對於使用者或第三人造成之不便或損害，本公司不負損害賠償責任。
第12條(票券購買)

使用者依本系統步驟購買票券之訂單，交易狀態出現「訂單成立」之確認畫面時，買賣契約即已成立，使用者不得以任何理由要求取消訂單，僅得依退票規則處理。
於發售期間內，若本系統可售票券數量已全數售盡，本公司得隨時終止該節目場次之售票程序，此後如有退票釋出或主辦單位追加公演及座席之狀況，本公司得不另行公告重啟售票程序。
票券付款方式，使用者僅得就各該節目指定之方式選擇之。使用者若選擇信用卡付款方式，於刷卡完成時，本系統即同時向發卡銀行請求支付本筆訂單費用；若選擇ATM轉帳或超商付款時，使用者須於訂單顯示之「繳款期限」內完成付款。除本系統設定之自動轉換付款方式，使用者一旦選定付款方式後即不得要求變更。
使用者如欲購買特殊折扣優惠之票種，請詳閱本系統指示後操作。訂購清單中之合計金額，即為使用者當次購票需支付之總金額，一經送出結帳，恕無法再行折扣。
票券取票方式，使用者僅得就各該節目指定之方式選擇之。現場取票之取票者資料及郵寄取票之收件者資料綁定為訂購會員資料。為防盜用帳號及詐騙行為，訂購會員資料係以該訂單送出當下之會員資料為準，恕不提供事後姓名、電話或地址之變更申請服務。
於使用者發生下列情形之一時，本公司有權拒絕售出票券，或解除之買賣契約：
未於本系統公告之期限內完成規定之手續時。
未遵守主辦單位於本系統內指定之購票方式時。
未在系統指定期限內付款或付款金額錯誤時。
異常大量交易時。
以不正行為妨礙正常售票時。
有其他違反本條款之情事時。
本系統所售出之娛樂票券字號均經主管機關發函核准使用，並依法向演出所在地之稅捐處報繳娛樂稅，故票面金額不須開立統一發票，僅開立屬於「服務費」金額之發票。
第13條(個人資料處理)

使用者於本系統所提供之個人資料(包括但不限於信用卡卡號等資訊)，本公司將依個人資料保護法相關法令及本公司之「隱私權政策」妥善保護。
第14條(使用者數據)

本系統為提供更完善之服務，可能對使用者進行問卷調查、資訊收集、分析等動作。其中已無從直接或間接識別該特定個人之資訊，已非屬個人資料保護法所稱之個人資料，本公司得用於新聞發表、問卷結果公布、行銷活動或其他營運所需之用途，亦得提供委託本系統處理售票事務之活動主辦單位。
第15條(資訊安全)

為防止使用者訂購票券、付款時個人資料及金融資訊受惡意第三人竊取、妨害或其他不正使用，本系統全面使用SSL加密技術傳輸電子數據，以保護使用者個人資料之安全。
第16條(電子報、電子郵件通知等)

就本系統所提供之服務、優惠、所銷售票券、商品等相關情報之電子報或電子郵件等訊息通知，使用者得選擇是否同意訂閱，亦得隨時取消訂閱。
第17條(免責事項)

使用者使用本系統時，應秉持一定之注意義務，妥善保管自己之帳號密碼，不得將帳號密碼洩露或提供給第三人知悉或使用，並詳讀所有條款及注意事項；以同一個帳號使用本系統所進行的所有購買行為，視為該會員帳號本人的行為，應由該使用者依法負責。
未成年人購買高價票券應事先取得法定代理人之同意，如未成年人使用者使用本系統購買票券，即推定其法定代理人已同意該次交易，其後因使用者自身因素所生消費糾紛，本公司不負任何法律責任。
本公司就本系統內活動資訊、服務之提供、遲延、變更、中斷、中止、停止、廢除或其他就本系統之利用，而致使用者或第三人受有損害，除可歸責於本公司之故意、重大過失外，本公司不負擔任何責任。
除各該活動主辦單位、協力單位、贊助廠商之官方媒體外，若其他演出活動資訊揭載、分享網站等第三方媒體可直接連結至本系統，亦不表示該第三方媒體與本系統有任何關係，本系統亦不保證第三方媒體上資訊之正確性及安全性。使用者因使用第三方媒體獲取資訊、購買票券所生之糾紛，概與本公司無涉。
各別節目資訊皆由主辦單位制定提供，本公司對活動演出之演出內容、文宣所稱之品質等真實性不負審查責任；延遲演出、改期及相關事宜亦由活動主辦單位負責，本公司不負遲延責任。
本系統不保證能全數滿足利用者就場次、張數、座位等之購票期望；入場後利用者如對所購票券座位有任何疑義，除可歸責於本公司之故意、重大過失外，概與本公司無涉。
本公司不保證於拍賣網站、電子佈告欄、論壇、二手票券網站上所出售之票券真偽及價格，使用者利用非本系統購入票券所生之糾紛，概與本公司無涉。
第18條(紛爭)

若使用者因使用本系統致第三人受有損害，或使用者間因使用本系統而生糾紛，應由當事者間自行協調或循法律管道排解，概與本公司無涉。
第19條(語言版本)

本條款之中文版與其他語言版本間若有疑義、矛盾、不符之處，皆以中文版之文字為準。
第20條(協議優先)

使用者與本公司間若因本系統服務產生紛爭時，雙方應先秉持誠意協商，共同努力解決。
第21條(準據法及管轄)

本條款之解釋與適用，以及與本條款有關的爭議，均應依照中華民國法律予以處理，並以台灣台北地方法院為第一審管轄法院。
■本會員服務條款最近一次修改時間：2018 年 05 月 02 日。

■本會員服務條款公告頒布時間：2017 年 09 月 07 日。
			</div>
        );
    }
}
export default MemberShipRules;



// 第1條(定義)

